#+TITLE: Optimizing Models along multiple standard and custom metrics
* COMMENT dependencies
#+begin_src jupyter-python :session sm :kernel aikit :exports results :results raw drawer
  import sqlite3
  import pandas as pd
  import numpy as np
  # featurization
  from cmcl.data.frame import *
  from cmcl.features.categories import Categories
  ## accelerated ml pipeline ##
  from sklearn.intelex import patch_sklearn
  patch_sklearn()
  # feature engineering
  from sklearn.impute import SimpleImputer
  from sklearn.preprocessing import Normalizer, StandardScaler
  from sklearn.compose import TransformedTargetRegressor as ytRegressor
  # predictors
  from sklearn.ensemble import RandomForestRegressor
  from sklearn.gaussian_process import GaussianProcessRegressor
  from sklearn.gaussian_process.kernels import DotProduct, WhiteKernel, RBF, Matern, RationalQuadratic, ExpSineSquared, ConstantKernel
  from sklearn.ensemble import GradientBoostingRegressor
  ## pipeline workflow
  from sklearn.pipeline import make_pipeline as mkpipe
  from sklearn.model_selection import train_test_split as tts
  from sklearn.model_selection import GridSearchCV as gsCV
  # model eval
  from sklearn.metrics import make_scorer, mean_squared_error, r2_score, explained_variance_score, max_error
  #visualization
  import matplotlib.pyplot as plt
  from sklearn import set_config
#+end_src

  #+RESULTS:
  :RESULTS:
  # [goto error]
  : [0;31m---------------------------------------------------------------------------[0m
  : [0;31mModuleNotFoundError[0m                       Traceback (most recent call last)
  : Input [0;32mIn [3][0m, in [0;36m<cell line: 8>[0;34m()[0m
  : [1;32m      6[0m [38;5;28;01mfrom[39;00m [38;5;21;01mcmcl[39;00m[38;5;21;01m.[39;00m[38;5;21;01mfeatures[39;00m[38;5;21;01m.[39;00m[38;5;21;01mcategories[39;00m [38;5;28;01mimport[39;00m Categories
  : [1;32m      7[0m [38;5;66;03m## accelerated ml pipeline ##[39;00m
  : [0;32m----> 8[0m [38;5;28;01mfrom[39;00m [38;5;21;01msklearn[39;00m[38;5;21;01m.[39;00m[38;5;21;01mintelex[39;00m [38;5;28;01mimport[39;00m patch_sklearn
  : [1;32m      9[0m patch_sklearn()
  : [1;32m     10[0m [38;5;66;03m# feature engineering[39;00m
  : 
  : [0;31mModuleNotFoundError[0m: No module named 'sklearn.intelex'
  :END:
